{ "translations": {
    "Grant access": "Cấp phép truy cập",
    "Error configuring OAuth1": "Lỗi khi định cấu hình OAuth1",
    "Please provide a valid app key and secret.": "Vui lòng cung cấp khóa ứng dụng hợp lệ và bí mật.",
    "Error configuring OAuth2": "Lỗi khi định cấu hình OAuth2",
    "Generate keys": "Tạo khóa",
    "Error generating key pair": "Lỗi tạo cặp khóa",
    "Type to select account or group.": "Nhập để chọn tài khoản hoặc nhóm.",
    "(Group)": "(Nhóm)",
    "Compatibility with Mac NFD encoding (slow)": "Khả năng tương thích với mã hóa Mac NFD (chậm)",
    "Enable encryption": "Cho phép mã hóa",
    "Enable previews": "Bật xem trước",
    "Enable sharing": "Bật chia sẻ",
    "Check for changes": "Kiểm tra các thay đổi",
    "Never": "Không bao giờ",
    "Once every direct access": "Mỗi lần truy cập trực tiếp",
    "Read only": "Chỉ đọc",
    "Disconnect": "Ngắt kết nối",
    "Admin defined": "Quản trị viên xác định",
    "Automatic status checking is disabled due to the large number of configured storages, click to check status": "Kiểm tra trạng thái tự động bị tắt do số lượng lớn kho lưu trữ được định cấu hình, nhấp để kiểm tra trạng thái",
    "Are you sure you want to disconnect this external storage? It will make the storage unavailable in Nextcloud and will lead to a deletion of these files and folders on any sync client that is currently connected but will not delete any files and folders on the external storage itself.": "Bạn có chắc chắn muốn ngắt kết nối bộ nhớ ngoài này không? ",
    "Delete storage?": "Xóa bộ nhớ?",
    "Saved": "Đã lưu",
    "Saving …": "Tiết kiệm …",
    "Save": "Cứu",
    "Forbidden to manage local mounts": "Bị cấm quản lý thú cưỡi cục bộ",
    "Storage with ID \"%d\" not found": "Không tìm thấy bộ nhớ có ID \"%d\"",
    "Invalid backend or authentication mechanism class": "Lớp cơ chế xác thực hoặc phụ trợ không hợp lệ",
    "Invalid mount point": "Điểm gắn kết không hợp lệ",
    "Objectstore forbidden": "Cửa hàng đối tượng bị cấm",
    "Invalid storage backend \"%s\"": "Phần phụ trợ lưu trữ không hợp lệ \"%s\"",
    "Not permitted to use backend \"%s\"": "Không được phép sử dụng phụ trợ \"%s\"",
    "Not permitted to use authentication mechanism \"%s\"": "Không được phép sử dụng cơ chế xác thực \"%s\"",
    "Unsatisfied backend parameters": "Thông số phụ trợ không thỏa mãn",
    "Unsatisfied authentication mechanism parameters": "Thông số cơ chế xác thực không thỏa mãn",
    "Insufficient data: %s": "Dữ liệu không đủ: %s",
    "%s": "%S",
    "Storage with ID \"%d\" is not editable by non-admins": "Bộ nhớ có ID \"%d\" không thể chỉnh sửa được bởi những người không phải quản trị viên",
    "Access key": "Khóa truy cập",
    "Secret key": "Chìa khoá bí mật",
    "Builtin": "Được xây dựng trong",
    "None": "Không có",
    "OAuth1": "OAuth1",
    "App key": "Khóa ứng dụng",
    "App secret": "Ứng dụng bí mật",
    "OAuth2": "OAuth2",
    "Client ID": "ID khách hàng",
    "Client secret": "Bí mật của khách hàng",
    "OpenStack v2": "OpenStack v2",
    "Login": "Đăng nhập",
    "Password": "Mật khẩu",
    "Tenant name": "Tên người thuê nhà",
    "Identity endpoint URL": "URL điểm cuối nhận dạng",
    "OpenStack v3": "OpenStack v3",
    "Domain": "Lãnh địa",
    "Rackspace": "Không gian giá đỡ",
    "API key": "Mã API",
    "Global credentials": "Thông tin toàn cầu",
    "Log-in credentials, save in database": "Thông tin đăng nhập, lưu vào cơ sở dữ liệu",
    "Login and password": "Đăng nhập và mật khẩu",
    "Log-in credentials, save in session": "Thông tin đăng nhập, lưu trong phiên",
    "Global credentials, manually entered": "Thông tin xác thực toàn cầu, được nhập thủ công",
    "Manually entered, store in database": "Nhập thủ công, lưu trữ trong cơ sở dữ liệu",
    "RSA public key": "Khóa công khai RSA",
    "Public key": "Khóa công khai",
    "RSA private key": "Khóa riêng RSA",
    "Private key": "Khóa riêng",
    "Kerberos default realm, defaults to \"WORKGROUP\"": "Vùng mặc định của Kerberos, mặc định là \"WORKGROUP\"",
    "Kerberos ticket Apache mode": "Chế độ Apache của vé Kerberos",
    "Kerberos ticket": "Vé Kerberos",
    "Amazon S3": "Amazon S3",
    "Bucket": "Gầu múc",
    "Hostname": "Tên máy chủ",
    "Port": "Hải cảng",
    "Region": "Vùng đất",
    "Storage Class": "Lớp lưu trữ",
    "Enable SSL": "Kích hoạt SSL",
    "Enable Path Style": "Bật kiểu đường dẫn",
    "Legacy (v2) authentication": "Xác thực kế thừa (v2)",
    "Enable multipart copy": "Bật sao chép nhiều phần",
    "WebDAV": "WebDAV",
    "URL": "URL",
    "Remote subfolder": "Thư mục con từ xa",
    "Secure https://": "Bảo mật https://",
    "FTP": "FTP",
    "Host": "Chủ nhà",
    "Secure ftps://": "Bảo mật ftps://",
    "Local": "Địa phương",
    "Location": "Vị trí",
    "Nextcloud": "Nextcloud",
    "SFTP": "SFTP",
    "Root": "Nguồn gốc",
    "SFTP with secret key login": "SFTP với thông tin đăng nhập khóa bí mật",
    "SMB/CIFS": "SMB/CIFS",
    "Share": "Chia sẻ",
    "Show hidden files": "Hiển thị cac file bị ẩn",
    "Case sensitive file system": "Hệ thống tập tin phân biệt chữ hoa chữ thường",
    "Disabling it will allow to use a case insensitive file system, but comes with a performance penalty": "Việc vô hiệu hóa nó sẽ cho phép sử dụng hệ thống tệp không phân biệt chữ hoa chữ thường nhưng đi kèm với một hình phạt về hiệu suất",
    "Verify ACL access when listing files": "Xác minh quyền truy cập ACL khi liệt kê tệp",
    "Check the ACL's of each file or folder inside a directory to filter out items where the account has no read permissions, comes with a performance penalty": "Kiểm tra ACL của từng tệp hoặc thư mục bên trong một thư mục để lọc ra các mục mà tài khoản không có quyền đọc, đi kèm với hình phạt về hiệu suất",
    "Timeout": "Hết giờ",
    "SMB/CIFS using OC login": "SMB/CIFS sử dụng đăng nhập OC",
    "Login as share": "Đăng nhập dưới dạng chia sẻ",
    "OpenStack Object Storage": "Lưu trữ đối tượng OpenStack",
    "Service name": "Tên dịch vụ",
    "Request timeout (seconds)": "Thời gian chờ yêu cầu (giây)",
    "The cURL support in PHP is not enabled or installed. Mounting of %s is not possible. Please ask your system administrator to install it.": "Hỗ trợ cURL trong PHP chưa được bật hoặc cài đặt. ",
    "The FTP support in PHP is not enabled or installed. Mounting of %s is not possible. Please ask your system administrator to install it.": "Hỗ trợ FTP trong PHP chưa được bật hoặc cài đặt. ",
    "\"%1$s\" is not installed. Mounting of %2$s is not possible. Please ask your system administrator to install it.": "\"%1$s\" chưa được cài đặt. ",
    "External storage": "Lưu trữ ngoài",
    "External storage support": "Hỗ trợ lưu trữ ngoài",
    "Adds basic external storage support": "Thêm hỗ trợ lưu trữ bên ngoài cơ bản",
    "This application enables administrators to configure connections to external storage providers, such as FTP servers, S3 or SWIFT object stores, other Nextcloud servers, WebDAV servers, and more. Administration can choose which types of storage to enable and can mount these storage locations for an account, a group, or the entire system. Users will see a new folder appear in their root Nextcloud directory, which they can access and use like any other Nextcloud folder. External storage also allows people to share files stored in these external locations. In these cases, the credentials for the owner of the file are used when the recipient requests the file from external storage, thereby ensuring that the recipient can access the shared file.\n\nExternal storage can be configured using the GUI or at the command line. This second option provides the administration with more flexibility for configuring bulk external storage mounts and setting mount priorities. More information is available in the external storage GUI documentation and the external storage Configuration File documentation.": "Ứng dụng này cho phép quản trị viên định cấu hình kết nối với các nhà cung cấp bộ nhớ ngoài, chẳng hạn như máy chủ FTP, cửa hàng đối tượng S3 hoặc SWIFT, máy chủ Nextcloud khác, máy chủ WebDAV, v.v. ",
    "Enter missing credentials": "Nhập thông tin xác thực bị thiếu",
    "Unable to update this external storage config. {statusMessage}": "Không thể cập nhật cấu hình bộ nhớ ngoài này. ",
    "New configuration successfully saved": "Đã lưu thành công cấu hình mới",
    "There was an error with this external storage.": "Đã xảy ra lỗi với bộ nhớ ngoài này.",
    "We were unable to check the external storage {basename}": "Chúng tôi không thể kiểm tra bộ nhớ ngoài {basename}",
    "Examine this faulty external storage configuration": "Kiểm tra cấu hình bộ nhớ ngoài bị lỗi này",
    "Open in Files": "Mở trong Tệp",
    "There was an error with this external storage. Do you want to review this mount point config in the settings page?": "Đã xảy ra lỗi với bộ nhớ ngoài này. ",
    "External mount error": "Lỗi gắn ngoài",
    "List of external storage.": "Danh sách bộ nhớ ngoài.",
    "There is no external storage configured. You can configure them in your Personal settings.": "Không có bộ nhớ ngoài được cấu hình. ",
    "There is no external storage configured and you don't have the permission to configure them.": "Không có bộ nhớ ngoài nào được định cấu hình và bạn không có quyền định cấu hình chúng.",
    "No external storage": "Không có bộ nhớ ngoài",
    "Storage type": "Loại lưu trữ",
    "Unknown": "không xác định",
    "Scope": "Phạm vi",
    "Personal": "Riêng tư",
    "System": "Hệ thống",
    "No external storage configured or you don't have the permission to configure them": "Không có bộ nhớ ngoài nào được định cấu hình hoặc bạn không có quyền định cấu hình chúng",
    "Open documentation": "Mở tài liệu",
    "External storage enables you to mount external storage services and devices as secondary Nextcloud storage devices. You may also allow people to mount their own external storage services.": "Bộ nhớ ngoài cho phép bạn gắn các thiết bị và dịch vụ lưu trữ bên ngoài làm thiết bị lưu trữ Nextcloud thứ cấp. ",
    "Folder name": "Tên thư mục",
    "Authentication": "Xác thực",
    "Configuration": "Cấu hình",
    "Available for": "Có sẵn cho",
    "Click to recheck the configuration": "Click để kiểm tra lại cấu hình",
    "Add storage": "Thêm bộ nhớ",
    "All people": "Tất cả mọi người",
    "Advanced settings": "Cài đặt nâng cao",
    "Allow people to mount external storage": "Cho phép mọi người gắn bộ nhớ ngoài",
    "Global credentials can be used to authenticate with multiple external storages that have the same credentials.": "Thông tin xác thực chung có thể được sử dụng để xác thực với nhiều kho lưu trữ bên ngoài có cùng thông tin xác thực.",
    "Type to select user or group.": "Nhập để chọn người dùng hoặc nhóm.",
    "Empty response from the server": "Phản hồi trống từ máy chủ",
    "Couldn't access. Please log out and in again to activate this mount point": "Không thể truy cập. ",
    "Couldn't get the information from the remote server: {code} {type}": "Không thể lấy thông tin từ máy chủ từ xa: {code} {type}",
    "Couldn't get the list of external mount points: {type}": "Không thể lấy danh sách các điểm gắn kết bên ngoài: {type}",
    "There was an error with message: ": "Đã xảy ra lỗi với tin nhắn: ",
    "external-storage": "lưu trữ ngoài",
    "Couldn't fetch list of Windows network drive mount points: Empty response from server": "Không thể tìm nạp danh sách các điểm gắn ổ đĩa mạng Windows: Phản hồi trống từ máy chủ",
    "Please enter the credentials for the {mount} mount": "Vui lòng nhập thông tin xác thực cho giá treo {mount}",
    "Username": "tên tài khoản",
    "Credentials saved": "Đã lưu thông tin xác thực",
    "Credentials saving failed": "Lưu thông tin xác thực không thành công",
    "Credentials required": "Yêu cầu thông tin xác thực",
    "Storage with ID \"%d\" is not user editable": "Người dùng không thể chỉnh sửa bộ nhớ có ID \"%d\"",
    "Username and password": "Tên người dùng và mật khẩu",
    "Global credentials, user entered": "Thông tin xác thực toàn cầu, người dùng đã nhập",
    "User entered, store in database": "Người dùng đã nhập, lưu trữ trong cơ sở dữ liệu",
    "Disabling it will allow to use a case insentive file system, but comes with a performance penalty": "Việc vô hiệu hóa nó sẽ cho phép sử dụng hệ thống tệp không phân biệt chữ hoa chữ thường, nhưng đi kèm với một hình phạt về hiệu suất",
    "Check the ACL's of each file or folder inside a directory to filter out items where the user has no read permissions, comes with a performance penalty": "Kiểm tra ACL của từng tệp hoặc thư mục bên trong thư mục để lọc ra các mục mà người dùng không có quyền đọc, đi kèm với hình phạt về hiệu suất",
    "Username as share": "Tên người dùng là chia sẻ",
    "This application enables administrators to configure connections to external storage providers, such as FTP servers, S3 or SWIFT object stores, other Nextcloud servers, WebDAV servers, and more. Administrators can choose which types of storage to enable and can mount these storage locations for a user, a group, or the entire system. Users will see a new folder appear in their root Nextcloud directory, which they can access and use like any other Nextcloud folder. External storage also allows users to share files stored in these external locations. In these cases, the credentials for the owner of the file are used when the recipient requests the file from external storage, thereby ensuring that the recipient can access the shared file.\n\nExternal storage can be configured using the GUI or at the command line. This second option provides the advanced user with more flexibility for configuring bulk external storage mounts and setting mount priorities. More information is available in the external storage GUI documentation and the external storage Configuration File documentation.": "Ứng dụng này cho phép quản trị viên định cấu hình kết nối với các nhà cung cấp bộ nhớ ngoài, chẳng hạn như máy chủ FTP, cửa hàng đối tượng S3 hoặc SWIFT, máy chủ Nextcloud khác, máy chủ WebDAV, v.v. ",
    "Name": "Tên",
    "External storage enables you to mount external storage services and devices as secondary Nextcloud storage devices. You may also allow users to mount their own external storage services.": "Bộ nhớ ngoài cho phép bạn gắn các thiết bị và dịch vụ lưu trữ bên ngoài làm thiết bị lưu trữ Nextcloud thứ cấp. ",
    "All users": "Tất cả người dùng",
    "Allow users to mount external storage": "Cho phép người dùng gắn bộ nhớ ngoài"
  },"pluralForm" :"nplurals=1; plural=0;"
}