{ "translations": {
   "Shared with {email}": "Chia sẻ với {email}",
        "Shared with {email} by {actor}": "Chia sẻ với {email} bởi {actor}",
        "Unshared from {email}": "Ngừng chia sẻ từ {email}",
        "Unshared from {email} by {actor}": "Ngừng chia sẻ từ {email} bởi {actor}",
        "Password for mail share sent to {email}": "Mật khẩu cho chia sẻ qua email đã được gửi đến {email}",
        "Password for mail share sent to you": "Mật khẩu cho chia sẻ qua email đã được gửi đến bạn",
        "You shared {file} with {email} by mail": "Bạn đã chia sẻ {file} với {email} qua email",
        "{actor} shared {file} with {email} by mail": "{actor} đã chia sẻ {file} với {email} qua email",
        "You unshared {file} from {email} by mail": "Bạn đã ngừng chia sẻ {file} từ {email} qua email",
        "{actor} unshared {file} from {email} by mail": "{actor} đã ngừng chia sẻ {file} từ {email} qua email",
        "Password to access {file} was sent to {email}": "Mật khẩu để truy cập {file} đã được gửi đến {email}",
        "Password to access {file} was sent to you": "Mật khẩu để truy cập {file} đã được gửi đến bạn",
        "Share by mail": "Chia sẻ qua email",
        "Sharing %1$s failed, because this item is already shared with the account %2$s": "Chia sẻ %1$s thất bại, vì mục này đã được chia sẻ với tài khoản %2$s",
        "We cannot send you the auto-generated password. Please set a valid email address in your personal settings and try again.": "Chúng tôi không thể gửi cho bạn mật khẩu tự động được tạo. Vui lòng thiết lập địa chỉ email hợp lệ trong cài đặt cá nhân của bạn và thử lại.",
        "Failed to send share by email. Got an invalid email address": "Không thể gửi chia sẻ qua email. Đã nhận địa chỉ email không hợp lệ",
        "Failed to send share by email": "Không thể gửi chia sẻ qua email",
        "%1$s shared »%2$s« with you": "%1$s đã chia sẻ »%2$s« với bạn",
        "%1$s shared »%2$s« with you.": "%1$s đã chia sẻ »%2$s« với bạn.",
        "Click the button below to open it.": "Nhấn vào nút bên dưới để mở tập tin.",
        "Open »%s«": "Mở »%s«",
        "%1$s via %2$s": "%1$s qua %2$s",
        "%1$s shared »%2$s« with you.\nYou should have already received a separate mail with a link to access it.\n": "%1$s đã chia sẻ »%2$s« với bạn.\nBạn đã nhận được email riêng biệt có chứa liên kết để truy cập.",
        "%1$s shared »%2$s« with you. You should have already received a separate mail with a link to access it.": "%1$s đã chia sẻ »%2$s« với bạn. Bạn đã nhận được email riêng biệt có chứa liên kết để truy cập.",
        "Password to access »%1$s« shared to you by %2$s": "Mật khẩu để truy cập »%1$s« đã được chia sẻ cho bạn bởi %2$s",
        "Password to access »%s«": "Mật khẩu để truy cập »%s«",
        "It is protected with the following password:": "Nó được bảo vệ bằng mật khẩu sau:",
        "This password will expire at %s": "Mật khẩu này sẽ hết hạn vào %s",
        "%1$s shared »%2$s« with you and wants to add:": "%1$s đã chia sẻ »%2$s« với bạn và muốn thêm:",
        "%1$s shared »%2$s« with you and wants to add": "%1$s đã chia sẻ »%2$s« với bạn và muốn thêm",
        "»%s« added a note to a file shared with you": "»%s« đã thêm một ghi chú vào một tập tin đã được chia sẻ với bạn",
        "You just shared »%1$s« with %2$s. The share was already sent to the recipient. Due to the security policies defined by the administrator of %3$s each share needs to be protected by password and it is not allowed to send the password directly to the recipient. Therefore you need to forward the password manually to the recipient.": "Bạn vừa chia sẻ »%1$s« với %2$s. Việc chia sẻ đã được gửi đến người nhận. Do chính sách bảo mật được định nghĩa bởi quản trị viên của %3$s, mỗi chia sẻ cần được bảo vệ bằng mật khẩu và không được phép gửi mật khẩu trực tiếp cho người nhận. Do đó, bạn cần chuyển tiếp mật khẩu thủ công cho người nhận.",
        "Password to access »%1$s« shared by you with %2$s": "Mật khẩu để truy cập »%1$s« đã được bạn chia sẻ với %2$s",
        "This is the password:": "Đây là mật khẩu:",
        "You can choose a different password at any time in the share dialog.": "Bạn có thể chọn một mật khẩu khác bất kỳ lúc nào trong hộp thoại chia sẻ.",
        "Could not find share": "Không thể tìm thấy chia sẻ",
        "Share provider which allows you to share files by mail": "Nhà cung cấp chia sẻ cho phép bạn chia sẻ tập tin qua email",
        "Allows people to share a personalized link to a file or folder by putting in an email address.": "Cho phép người dùng chia sẻ liên kết cá nhân đến một tập tin hoặc thư mục bằng cách nhập địa chỉ email.",
        "Send password by mail": "Gửi mật khẩu qua email",
        "Reply to initiator": "Trả lời người khởi xướng",
        "Unable to update share by mail config": "Không thể cập nhật cấu hình chia sẻ qua email",
        "Sharing %1$s failed, because this item is already shared with user %2$s": "Chia sẻ %1$s thất bại, vì mục này đã được chia sẻ với người dùng %2$s",
        "Allows users to share a personalized link to a file or folder by putting in an email address.": "Cho phép người dùng chia sẻ một liên kết cá nhân đến một tập tin hoặc thư mục bằng cách nhập địa chỉ email."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}